// [news_id]/page.tsx
"use client";

import { useLocale, useTranslations } from "next-intl";
import React, { useMemo, useRef } from "react";

import { newsItems } from "@/lib/data";
import FormattedTextViewer from "@/components/FormattedTextViewer";
import PageWithFirstSection from "@/components/page/Page";

export default function SingleNewsPage() {
  const locale = useLocale();
  const t = useTranslations("Home");
  const ts = useTranslations("singleNews");

  const translatedNewsItems = useMemo(() => {
    return newsItems(t.raw("news.news"));
  }, [locale]);

  return (
    <PageWithFirstSection>
      <FormattedTextViewer>
        هذا النص هو نص تجريبي يبدأ بعد النقطة وقد تم وضعه كمحتوى تجريبي. شهدت
        الملاعب المغلقة لجامعة كلكامش لقاءات نسوية لمراحل المتوسطة والإعدادية
        بين تربيات الكرخ الثانية والرصافة الثانية بمعدل فريقين لكل تربية بهدف
        الكشف عن الخبرات والإمكانيات الرياضية بغية رفد منتخباتنا الوطنية بالدماء
        الشابة التي تساهم في حصد الإنجازات والبطولات خلال المشاركات الدولية.
        الجدير بالذكر أن جامعة كلكامش مستمرة بدعمها المرأة وعلى كافة الأصعدة
        والمجالات وهذا يأتي ضمن سياستها بتحقيق أهداف التنمية المستدامة في خدمة
        المجتمع. شهدت الملاعب المغلقة لجامعة كلكامش لقاءات نسوية لمراحل المتوسطة
        والإعدادية بين تربيات الكرخ الثانية والرصافة الثانية بمعدل فريقين لكل
        تربية بهدف الكشف عن الخبرات والإمكانيات الرياضية بغية رفد منتخباتنا
        الوطنية بالدماء الشابة التي تساهم في حصد الإنجازات والبطولات خلال
        المشاركات الدولية. الجدير بالذكر أن جامعة كلكامش مستمرة بدعمها المرأة
        وعلى كافة الأصعدة والمجالات وهذا يأتي ضمن سياستها بتحقيق أهداف التنمية
        المستدامة في خدمة المجتمع. شهدت الملاعب المغلقة لجامعة كلكامش لقاءات
        نسوية لمراحل المتوسطة والإعدادية بين تربيات الكرخ الثانية والرصافة
        الثانية بمعدل فريقين لكل تربية بهدف الكشف عن الخبرات والإمكانيات
        الرياضية بغية رفد منتخباتنا الوطنية بالدماء الشابة التي تساهم في حصد
        الإنجازات والبطولات خلال المشاركات الدولية. الجدير بالذكر أن جامعة
        كلكامش مستمرة بدعمها المرأة وعلى كافة الأصعدة والمجالات وهذا يأتي ضمن
        سياستها بتحقيق أهداف التنمية المستدامة في خدمة المجتمع. شهدت الملاعب
        المغلقة لجامعة كلكامش لقاءات نسوية لمراحل المتوسطة والإعدادية بين تربيات
        الكرخ الثانية والرصافة الثانية بمعدل فريقين لكل تربية بهدف الكشف عن
        الخبرات والإمكانيات الرياضية بغية رفد منتخباتنا الوطنية بالدماء الشابة
        التي تساهم في حصد الإنجازات والبطولات خلال المشاركات الدولية. الجدير
        بالذكر أن جامعة كلكامش مستمرة بدعمها المرأة وعلى كافة الأصعدة والمجالات
        وهذا يأتي ضمن سياستها بتحقيق أهداف التنمية المستدامة في خدمة المجتمع.
        شهدت الملاعب المغلقة لجامعة كلكامش لقاءات نسوية لمراحل المتوسطة
        والإعدادية بين تربيات الكرخ الثانية والرصافة الثانية بمعدل فريقين لكل
        تربية بهدف الكشف عن الخبرات والإمكانيات الرياضية بغية رفد منتخباتنا
        الوطنية بالدماء الشابة التي تساهم في حصد الإنجازات والبطولات خلال
        المشاركات الدولية. الجدير بالذكر أن جامعة كلكامش مستمرة بدعمها المرأة
        وعلى كافة الأصعدة والمجالات وهذا يأتي ضمن سياستها بتحقيق أهداف التنمية
        المستدامة في خدمة المجتمع. شهدت الملاعب المغلقة لجامعة كلكامش لقاءات
        نسوية لمراحل المتوسطة والإعدادية بين تربيات الكرخ الثانية والرصافة
        الثانية بمعدل فريقين لكل تربية بهدف الكشف عن الخبرات والإمكانيات
        الرياضية بغية رفد منتخباتنا الوطنية بالدماء الشابة التي تساهم في حصد
        الإنجازات والبطولات خلال المشاركات الدولية. الجدير بالذكر أن جامعة
        كلكامش مستمرة بدعمها المرأة وعلى كافة الأصعدة والمجالات وهذا يأتي ضمن
        سياستها بتحقيق أهداف التنمية المستدامة في خدمة المجتمع. شهدت الملاعب
        المغلقة لجامعة كلكامش لقاءات نسوية لمراحل المتوسطة والإعدادية بين تربيات
        الكرخ الثانية والرصافة الثانية بمعدل فريقين لكل تربية بهدف الكشف عن
        الخبرات والإمكانيات الرياضية بغية رفد منتخباتنا الوطنية بالدماء الشابة
        التي تساهم في حصد الإنجازات والبطولات خلال المشاركات الدولية. الجدير
        بالذكر أن جامعة كلكامش مستمرة بدعمها المرأة وعلى كافة الأصعدة والمجالات
        وهذا يأتي ضمن سياستها بتحقيق أهداف التنمية المستدامة في خدمة المجتمع.
        شهدت الملاعب المغلقة لجامعة كلكامش لقاءات نسوية لمراحل المتوسطة
        والإعدادية بين تربيات الكرخ الثانية والرصافة الثانية بمعدل فريقين لكل
        تربية بهدف الكشف عن الخبرات والإمكانيات الرياضية بغية رفد منتخباتنا
        الوطنية بالدماء الشابة التي تساهم في حصد الإنجازات والبطولات خلال
        المشاركات الدولية. الجدير بالذكر أن جامعة كلكامش مستمرة بدعمها المرأة
        وعلى كافة الأصعدة والمجالات وهذا يأتي ضمن سياستها بتحقيق أهداف التنمية
        المستدامة في خدمة المجتمع. شهدت الملاعب المغلقة لجامعة كلكامش لقاءات
        نسوية لمراحل المتوسطة والإعدادية بين تربيات الكرخ الثانية والرصافة
        الثانية بمعدل فريقين لكل تربية بهدف الكشف عن الخبرات والإمكانيات
        الرياضية بغية رفد منتخباتنا الوطنية بالدماء الشابة التي تساهم في حصد
        الإنجازات والبطولات خلال المشاركات الدولية. الجدير بالذكر أن جامعة
        كلكامش مستمرة بدعمها المرأة وعلى كافة الأصعدة والمجالات وهذا يأتي ضمن
        سياستها بتحقيق أهداف التنمية المستدامة في خدمة المجتمع. شهدت الملاعب
        المغلقة لجامعة كلكامش لقاءات نسوية لمراحل المتوسطة والإعدادية بين تربيات
        الكرخ الثانية والرصافة الثانية بمعدل فريقين لكل تربية بهدف الكشف عن
        الخبرات والإمكانيات الرياضية بغية رفد منتخباتنا الوطنية بالدماء الشابة
        التي تساهم في حصد الإنجازات والبطولات خلال المشاركات الدولية. الجدير
        بالذكر أن جامعة كلكامش مستمرة بدعمها المرأة وعلى كافة الأصعدة والمجالات
        وهذا يأتي ضمن سياستها بتحقيق أهداف التنمية المستدامة في خدمة المجتمع.
      </FormattedTextViewer>
    </PageWithFirstSection>
  );
}
