"use client";

import ActionsTitle from "@/components/page/FirstTitleSection/ActionsTitle";

import Section from "@/components/Section";
import Wrapper from "@/components/Wrapper";

import React from "react";

export default function UniversityCouncilClientPage() {
  return (
    <main>
      <ActionsTitle title="كلمة رئيس الجامعة"></ActionsTitle>
      <Section className="text-start">
        <Wrapper>
          <PresidentCard></PresidentCard>
        </Wrapper>
      </Section>
    </main>
  );
}

function PresidentCard() {
  return (
    <div className="flex flex-col justify-between bg-white">
      <div className="flex flex-col gap-[31px] text-primary sm:flex-row-reverse sm:gap-[70px] sm:p-[50px] 1920:gap-[140px]">
        <div className="flex flex-col gap-[50px] sm:w-[378px] sm:min-w-[378px]">
          <img src="/images/hero-bg.jpg" className="w-full object-cover"></img>
          <div className="flex flex-col px-[20px] sm:px-0">
            <h2 className="text-[18px] font-bold text-foreground sm:text-[22px] 1920:text-[34px]">
              أ.د.انور صبحي عبد الحسين
            </h2>
            <h3 className="mt-[10px] text-[14px] font-medium">رئيس الجامعة</h3>
          </div>
        </div>
        <p className="px-[20px] text-justify text-[16px] leading-[1.75em] sm:px-0 sm:text-[20px]">
          تأسست جامعة كلكامش بموجب الأمر الوزاري (1443) 27/1/2019 حيث تضم عدد من
          الكليات تؤلِّف مجتمعاً متميزاً للتعلُّم والبحوث، يتيح للطلبة الاستفادة
          من مزايا التعلُّم البحثي والمشاركة في أنشطة البحث والاكتشاف، وتشجعهم
          على تعميق البُعد الفكري من خلال تحديد المشكلات، والعمل على إيجاد
          الحلول التي تُقدِّمها التخصصات داخل كل كلية، وتعمل على تخريج طلبة
          متميزين يتمتعون بمهارات تعلُّم مستدامة، مثل التفكير النقدي، حل
          المشكلات، العمل الجماعي، والاتصالات مما يتيح لهم ذلك فرص المنافسة
          بقوة، وتحقيق النجاح في أسواق العمل المختلفة. تأسست جامعة كلكامش بموجب
          الأمر الوزاري (1443) 27/1/2019 حيث تضم عدد من الكليات تؤلِّف مجتمعاً
          متميزاً للتعلُّم والبحوث، يتيح للطلبة الاستفادة من مزايا التعلُّم
          البحثي والمشاركة في أنشطة البحث والاكتشاف، وتشجعهم على تعميق البُعد
          الفكري من خلال تحديد المشكلات، والعمل على إيجاد الحلول التي تُقدِّمها
          التخصصات داخل كل كلية، وتعمل على تخريج طلبة متميزين يتمتعون بمهارات
          تعلُّم مستدامة، مثل التفكير النقدي، حل المشكلات، العمل الجماعي،
          والاتصالات مما يتيح لهم ذلك فرص المنافسة بقوة، وتحقيق النجاح في أسواق
          العمل المختلفة. تأسست جامعة كلكامش بموجب الأمر الوزاري (1443)
          27/1/2019 حيث تضم عدد من الكليات تؤلِّف مجتمعاً متميزاً للتعلُّم
          والبحوث، يتيح للطلبة الاستفادة من مزايا التعلُّم البحثي والمشاركة في
          أنشطة البحث والاكتشاف، وتشجعهم على تعميق البُعد الفكري من خلال تحديد
          المشكلات، والعمل على إيجاد الحلول التي تُقدِّمها التخصصات داخل كل
          كلية، وتعمل على تخريج طلبة متميزين يتمتعون بمهارات تعلُّم مستدامة، مثل
          التفكير النقدي، حل المشكلات، العمل الجماعي، والاتصالات مما يتيح لهم
          ذلك فرص المنافسة بقوة، وتحقيق النجاح في أسواق العمل المختلفة. تأسست
          جامعة كلكامش بموجب الأمر الوزاري (1443) 27/1/2019 حيث تضم عدد من
          الكليات تؤلِّف مجتمعاً متميزاً للتعلُّم والبحوث، يتيح للطلبة الاستفادة
          من مزايا التعلُّم البحثي والمشاركة في أنشطة البحث والاكتشاف، وتشجعهم
          على تعميق البُعد الفكري من خلال تحديد المشكلات، والعمل على إيجاد
          الحلول التي تُقدِّمها التخصصات داخل كل كلية، وتعمل على تخريج طلبة
          متميزين يتمتعون بمهارات تعلُّم مستدامة، مثل التفكير النقدي، حل
          المشكلات، العمل الجماعي، والاتصالات مما يتيح لهم ذلك فرص المنافسة
          بقوة، وتحقيق النجاح في أسواق العمل المختلفة. تأسست جامعة كلكامش بموجب
          الأمر الوزاري (1443) 27/1/2019 حيث تضم عدد من الكليات تؤلِّف مجتمعاً
          متميزاً للتعلُّم والبحوث، يتيح للطلبة الاستفادة من مزايا التعلُّم
          البحثي والمشاركة في أنشطة البحث والاكتشاف، وتشجعهم على تعميق البُعد
          الفكري من خلال تحديد المشكلات، والعمل على إيجاد الحلول التي تُقدِّمها
          التخصصات داخل كل كلية، وتعمل على تخريج طلبة متميزين يتمتعون بمهارات
          تعلُّم مستدامة، مثل التفكير النقدي، حل المشكلات، العمل الجماعي،
          والاتصالات مما يتيح لهم ذلك فرص المنافسة بقوة، وتحقيق النجاح في أسواق
          العمل المختلفة.
        </p>
      </div>

      <div className="mx-auto mt-[20px] h-[5px] w-[calc(100%-40px)] bg-secondary sm:mt-0 sm:w-[calc(100%-100px)]"></div>
    </div>
  );
}
